zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_ANALOG.h
#define XCVR_ANALOG_XO_DIST_XO_DIST_TRIM_MASK    (0x3U)
#define XCVR_ANALOG_XO_DIST_XO_DIST_TRIM_SHIFT   (0U)
/*! XO_DIST_TRIM - reg_xo_dist_trim_dig[1:0]
 *  0b00..0.9 V ( Default )
 *  0b01..0.86 V
 *  0b10..0.95 V
 *  0b11..1.21 V
 */
#define XCVR_ANALOG_XO_DIST_XO_DIST_TRIM(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_XO_DIST_XO_DIST_TRIM_SHIFT)) & XCVR_ANALOG_XO_DIST_XO_DIST_TRIM_MASK)

#define XCVR_ANALOG_XO_DIST_XO_DIST_FLIP_MASK    (0x4U)
#define XCVR_ANALOG_XO_DIST_XO_DIST_FLIP_SHIFT   (2U)
/*! XO_DIST_FLIP - reg_xo_dist_flip_dig
 *  0b0..XO DIST doesn't flip the output clock relative to input clock
 *  0b1..XO DIST flip the output clock relative to input clock
 */
#define XCVR_ANALOG_XO_DIST_XO_DIST_FLIP(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_XO_DIST_XO_DIST_FLIP_SHIFT)) & XCVR_ANALOG_XO_DIST_XO_DIST_FLIP_MASK)

#define XCVR_ANALOG_XO_DIST_XO_DIST_BYPASS_MASK  (0x8U)
#define XCVR_ANALOG_XO_DIST_XO_DIST_BYPASS_SHIFT (3U)
/*! XO_DIST_BYPASS - reg_xo_dist_bypass
 *  0b0..XO DIST not bypass
 *  0b1..XO DIST bypass
 */
#define XCVR_ANALOG_XO_DIST_XO_DIST_BYPASS(x)    (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_XO_DIST_XO_DIST_BYPASS_SHIFT)) & XCVR_ANALOG_XO_DIST_XO_DIST_BYPASS_MASK)
/*! @} */

/*! @name PLL - RF Analog PLL Control */
/*! @{ */

#define XCVR_ANALOG_PLL_PLL_VCO_TRIM_KVT_MASK    (0x70U)
#define XCVR_ANALOG_PLL_PLL_VCO_TRIM_KVT_SHIFT   (4U)
/*! PLL_VCO_TRIM_KVT - reg_vco_trim_kvt_dig[2:0]
 *  0b000..50MHz/V
 *  0b100..60MHz/V for fref = 32M
 *  0b110..70MHz/V
 *  0b111..80MHz/V for fref = 26M
 */
#define XCVR_ANALOG_PLL_PLL_VCO_TRIM_KVT(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PLL_VCO_TRIM_KVT_SHIFT)) & XCVR_ANALOG_PLL_PLL_VCO_TRIM_KVT_MASK)

#define XCVR_ANALOG_PLL_PLL_VCO_EN_PKDET_MASK    (0x100U)
#define XCVR_ANALOG_PLL_PLL_VCO_EN_PKDET_SHIFT   (8U)
/*! PLL_VCO_EN_PKDET - reg_vco_en_pkdet_dig
 *  0b0..PKDET disable
 *  0b1..PKDET enable
 */
#define XCVR_ANALOG_PLL_PLL_VCO_EN_PKDET(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PLL_VCO_EN_PKDET_SHIFT)) & XCVR_ANALOG_PLL_PLL_VCO_EN_PKDET_MASK)

#define XCVR_ANALOG_PLL_PIC_VREF_CTRL_MASK       (0x600U)
#define XCVR_ANALOG_PLL_PIC_VREF_CTRL_SHIFT      (9U)
/*! PIC_VREF_CTRL - reg_pic_vref_ctrl_dig[1:0]
 *  0b00..VREF=0.268*VDDX (VREF=245 mV for VDDX=0.9 V)
 *  0b01..VREF=0.292*VDDX (VREF=266 mV for VDDX=0.9 V)
 *  0b10..VREF=0.317*VDDX (VREF=287 mV for VDDX=0.9 V)
 *  0b11..VREF=0.341*VDDX (VREF=307 mV for VDDX=0.9 V) - (recommended setting)
 */
#define XCVR_ANALOG_PLL_PIC_VREF_CTRL(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PIC_VREF_CTRL_SHIFT)) & XCVR_ANALOG_PLL_PIC_VREF_CTRL_MASK)

#define XCVR_ANALOG_PLL_PIC_SMOOTH_SWITCH_EN_MASK (0x800U)
#define XCVR_ANALOG_PLL_PIC_SMOOTH_SWITCH_EN_SHIFT (11U)
/*! PIC_SMOOTH_SWITCH_EN - reg_pic_smooth_switch_en_dig
 *  0b0..smoothing disable (recommended setting)
 *  0b1..smoothing enable
 */
#define XCVR_ANALOG_PLL_PIC_SMOOTH_SWITCH_EN(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PIC_SMOOTH_SWITCH_EN_SHIFT)) & XCVR_ANALOG_PLL_PIC_SMOOTH_SWITCH_EN_MASK)

#define XCVR_ANALOG_PLL_PLL_VCO_PIC_INPUT_EN_MASK (0x8000U)
#define XCVR_ANALOG_PLL_PLL_VCO_PIC_INPUT_EN_SHIFT (15U)
/*! PLL_VCO_PIC_INPUT_EN - reg_vco_pic_input_en_dig
 *  0b0..PIC_INPUT disable
 *  0b1..PIC_INPUT enable
 */
#define XCVR_ANALOG_PLL_PLL_VCO_PIC_INPUT_EN(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PLL_VCO_PIC_INPUT_EN_SHIFT)) & XCVR_ANALOG_PLL_PLL_VCO_PIC_INPUT_EN_MASK)

#define XCVR_ANALOG_PLL_PIC_RINT1_HVAL_SM_EN_MASK (0x10000U)
#define XCVR_ANALOG_PLL_PIC_RINT1_HVAL_SM_EN_SHIFT (16U)
/*! PIC_RINT1_HVAL_SM_EN - reg_pic_rint1_hval_sm_en_dig
 *  0b0..PIC_RINT1_HVAL_SM disable (Rint1=30 kohms) - (recommended setting)
 *  0b1..PIC_RINT1_HVAL_SM enable (Rint1=60 kohms)
 */
#define XCVR_ANALOG_PLL_PIC_RINT1_HVAL_SM_EN(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PIC_RINT1_HVAL_SM_EN_SHIFT)) & XCVR_ANALOG_PLL_PIC_RINT1_HVAL_SM_EN_MASK)

#define XCVR_ANALOG_PLL_PIC_RINT2_VAL_SLOW_MODE_MASK (0x60000U)
#define XCVR_ANALOG_PLL_PIC_RINT2_VAL_SLOW_MODE_SHIFT (17U)
/*! PIC_RINT2_VAL_SLOW_MODE - reg_pic_rint2_val_slow_mode_dig[1:0]
 *  0b00..Rint2=90 kohms
 *  0b01..Rint2=210 kohms
 *  0b10..Rint2=450 kohms (recommended setting)
 *  0b11..Rint2=450 kohms
 */
#define XCVR_ANALOG_PLL_PIC_RINT2_VAL_SLOW_MODE(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PIC_RINT2_VAL_SLOW_MODE_SHIFT)) & XCVR_ANALOG_PLL_PIC_RINT2_VAL_SLOW_MODE_MASK)

#define XCVR_ANALOG_PLL_PIC_SPARE_MASK           (0x180000U)
#define XCVR_ANALOG_PLL_PIC_SPARE_SHIFT          (19U)
/*! PIC_SPARE - reg_pic_spare_dig[1:0] */
#define XCVR_ANALOG_PLL_PIC_SPARE(x)             (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PIC_SPARE_SHIFT)) & XCVR_ANALOG_PLL_PIC_SPARE_MASK)

#define XCVR_ANALOG_PLL_MUXCREF_DIVN_MASK        (0x200000U)
#define XCVR_ANALOG_PLL_MUXCREF_DIVN_SHIFT       (21U)
/*! MUXCREF_DIVN - reg_muxcref_divn */
#define XCVR_ANALOG_PLL_MUXCREF_DIVN(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_MUXCREF_DIVN_SHIFT)) & XCVR_ANALOG_PLL_MUXCREF_DIVN_MASK)

#define XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLDN_MASK (0x400000U)
#define XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLDN_SHIFT (22U)
/*! PLL_PD_EN_VPD_PULLDN - reg_pd_en_vpd_pulldn_dig
 *  0b0..not pull down vpd output
 *  0b1..pull down vpd output
 */
#define XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLDN(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLDN_SHIFT)) & XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLDN_MASK)

#define XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLUP_MASK (0x800000U)
#define XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLUP_SHIFT (23U)
/*! PLL_PD_EN_VPD_PULLUP - reg_pd_en_vpd_pullup_dig
 *  0b0..not pull up vpd output
 *  0b1..pull up vpd output
 */
#define XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLUP(x)  (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLUP_SHIFT)) & XCVR_ANALOG_PLL_PLL_PD_EN_VPD_PULLUP_MASK)

#define XCVR_ANALOG_PLL_PLL_PD_TRIM_FCAL_BIAS_MASK (0xC000000U)
#define XCVR_ANALOG_PLL_PLL_PD_TRIM_FCAL_BIAS_SHIFT (26U)
/*! PLL_PD_TRIM_FCAL_BIAS - reg_pd_trim_fcal_bias_dig[1:0]
 *  0b00..0.276V (recommended setting for legacy operation)
 *  0b01..0.164V
 *  0b10..0.320V (recommended setting for PIC use)
 *  0b11..0.391V
 */
#define XCVR_ANALOG_PLL_PLL_PD_TRIM_FCAL_BIAS(x) (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_PLL_PLL_PD_TRIM_FCAL_BIAS_SHIFT)) & XCVR_ANALOG_PLL_PLL_PD_TRIM_FCAL_BIAS_MASK)

