zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_XCVR_ANALOG.h
#define XCVR_ANALOG_DIAG_ADC_DIAG_SEL_MASK       (0x200000U)
#define XCVR_ANALOG_DIAG_ADC_DIAG_SEL_SHIFT      (21U)
/*! ADC_DIAG_SEL - reg_adc_diag_sel_dig */
#define XCVR_ANALOG_DIAG_ADC_DIAG_SEL(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_ADC_DIAG_SEL_SHIFT)) & XCVR_ANALOG_DIAG_ADC_DIAG_SEL_MASK)

#define XCVR_ANALOG_DIAG_PD_DIAG_SEL_MASK        (0x800000U)
#define XCVR_ANALOG_DIAG_PD_DIAG_SEL_SHIFT       (23U)
/*! PD_DIAG_SEL - reg_pd_diag_sel_dig */
#define XCVR_ANALOG_DIAG_PD_DIAG_SEL(x)          (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_PD_DIAG_SEL_SHIFT)) & XCVR_ANALOG_DIAG_PD_DIAG_SEL_MASK)

#define XCVR_ANALOG_DIAG_VCO_DIAG_SEL_MASK       (0x1000000U)
#define XCVR_ANALOG_DIAG_VCO_DIAG_SEL_SHIFT      (24U)
/*! VCO_DIAG_SEL - reg_vco_diag_sel_dig */
#define XCVR_ANALOG_DIAG_VCO_DIAG_SEL(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_VCO_DIAG_SEL_SHIFT)) & XCVR_ANALOG_DIAG_VCO_DIAG_SEL_MASK)

#define XCVR_ANALOG_DIAG_DAC_DIAG_SEL_MASK       (0x2000000U)
#define XCVR_ANALOG_DIAG_DAC_DIAG_SEL_SHIFT      (25U)
/*! DAC_DIAG_SEL - reg_dac_diag_sel_dig */
#define XCVR_ANALOG_DIAG_DAC_DIAG_SEL(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_DAC_DIAG_SEL_SHIFT)) & XCVR_ANALOG_DIAG_DAC_DIAG_SEL_MASK)

#define XCVR_ANALOG_DIAG_PIC_DIAG_SEL_MASK       (0x4000000U)
#define XCVR_ANALOG_DIAG_PIC_DIAG_SEL_SHIFT      (26U)
/*! PIC_DIAG_SEL - reg_pic_diag_sel_dig */
#define XCVR_ANALOG_DIAG_PIC_DIAG_SEL(x)         (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_PIC_DIAG_SEL_SHIFT)) & XCVR_ANALOG_DIAG_PIC_DIAG_SEL_MASK)

#define XCVR_ANALOG_DIAG_XO_DIST_DIAG_SEL_MASK   (0x8000000U)
#define XCVR_ANALOG_DIAG_XO_DIST_DIAG_SEL_SHIFT  (27U)
/*! XO_DIST_DIAG_SEL - reg_xo_dist_diag_sel_dig */
#define XCVR_ANALOG_DIAG_XO_DIST_DIAG_SEL(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_XO_DIST_DIAG_SEL_SHIFT)) & XCVR_ANALOG_DIAG_XO_DIST_DIAG_SEL_MASK)

#define XCVR_ANALOG_DIAG_LDO_ANT_DIAG_SEL_MASK   (0x10000000U)
#define XCVR_ANALOG_DIAG_LDO_ANT_DIAG_SEL_SHIFT  (28U)
/*! LDO_ANT_DIAG_SEL - reg_ldo_ant_diag_sel_dig */
#define XCVR_ANALOG_DIAG_LDO_ANT_DIAG_SEL(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_LDO_ANT_DIAG_SEL_SHIFT)) & XCVR_ANALOG_DIAG_LDO_ANT_DIAG_SEL_MASK)

#define XCVR_ANALOG_DIAG_DAC_AMP_DIAG_SEL_MASK   (0x20000000U)
#define XCVR_ANALOG_DIAG_DAC_AMP_DIAG_SEL_SHIFT  (29U)
/*! DAC_AMP_DIAG_SEL - reg_dac_amp_diag_sel_dig */
#define XCVR_ANALOG_DIAG_DAC_AMP_DIAG_SEL(x)     (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_DAC_AMP_DIAG_SEL_SHIFT)) & XCVR_ANALOG_DIAG_DAC_AMP_DIAG_SEL_MASK)

#define XCVR_ANALOG_DIAG_DIAG_DIS_MASK           (0x40000000U)
#define XCVR_ANALOG_DIAG_DIAG_DIS_SHIFT          (30U)
/*! DIAG_DIS - reg_diag_dis_dig */
#define XCVR_ANALOG_DIAG_DIAG_DIS(x)             (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_DIAG_DIS_SHIFT)) & XCVR_ANALOG_DIAG_DIAG_DIS_MASK)

#define XCVR_ANALOG_DIAG_ATX_ON_2P4GHZ_MASK      (0x80000000U)
#define XCVR_ANALOG_DIAG_ATX_ON_2P4GHZ_SHIFT     (31U)
/*! ATX_ON_2P4GHZ - reg_2p4ghz_atx_on_dig */
#define XCVR_ANALOG_DIAG_ATX_ON_2P4GHZ(x)        (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_DIAG_ATX_ON_2P4GHZ_SHIFT)) & XCVR_ANALOG_DIAG_ATX_ON_2P4GHZ_MASK)
/*! @} */

/*! @name SPARE - RF Analog SPARE Control */
/*! @{ */

#define XCVR_ANALOG_SPARE_SPARELV_MASK           (0xFU)
#define XCVR_ANALOG_SPARE_SPARELV_SHIFT          (0U)
/*! SPARELV - reg_sparelv_dig[3:0] */
#define XCVR_ANALOG_SPARE_SPARELV(x)             (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_SPARE_SPARELV_SHIFT)) & XCVR_ANALOG_SPARE_SPARELV_MASK)

#define XCVR_ANALOG_SPARE_SPARE_DIAG_SEL_MASK    (0x3000U)
#define XCVR_ANALOG_SPARE_SPARE_DIAG_SEL_SHIFT   (12U)
/*! SPARE_DIAG_SEL - reg_spare_diag_sel_dig[1:0] */
#define XCVR_ANALOG_SPARE_SPARE_DIAG_SEL(x)      (((uint32_t)(((uint32_t)(x)) << XCVR_ANALOG_SPARE_SPARE_DIAG_SEL_SHIFT)) & XCVR_ANALOG_SPARE_SPARE_DIAG_SEL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group XCVR_ANALOG_Register_Masks */


/*!
 * @}
 */ /* end of group XCVR_ANALOG_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_XCVR_ANALOG_H_ */

